
-DATASET CSV tinysnb
--

-LOG DropAndCreateTables
-SKIP: Drop is not supported yet. (TODO: zhanglei)
-STATEMENT DROP TABLE studyAt
---- ok
-STATEMENT MATCH ()-[e:studyAt]->() RETURN count(*)
---- error
Binder exception: Table studyAt does not exist.
-STATEMENT DROP TABLE workAt
---- ok
-STATEMENT MATCH ()-[e:workAt]->() RETURN count(*)
---- error
Binder exception: Table workAt does not exist.
-STATEMENT DROP TABLE organisation
---- ok
-STATEMENT MATCH (n:organisation) RETURN count(*)
---- error
Binder exception: Table organisation does not exist.
-STATEMENT DROP TABLE movies
---- ok
-STATEMENT MATCH (n:movies) RETURN count(*)
---- error
Binder exception: Table movies does not exist.
-STATEMENT create node table organisation (ID INT64, name STRING, orgCode INT64, mark DOUBLE, score INT64, history STRING, licenseValidInterval INTERVAL, rating DOUBLE, PRIMARY KEY (ID))
---- ok
-STATEMENT create rel table studyAt (FROM person TO organisation, year INT64, places STRING[], MANY_TO_ONE) WITH (storage_direction = 'both');
---- ok
-STATEMENT create rel table workAt (FROM person TO organisation, year INT64, grading DOUBLE[2], rating float, MANY_TO_ONE) WITH (storage_direction = 'invalid');
---- error
Runtime exception: Cannot parse invalid as ExtendDirection.
-STATEMENT create rel table workAt (FROM person TO organisation, year INT64, grading DOUBLE[2], rating float, MANY_TO_ONE) WITH (storage_direction = 'fwd');
---- ok
-STATEMENT match (o:organisation) return o.name
---- ok
-STATEMENT match (:person)-[s:studyAt]->(:organisation) return s.year
---- ok
-STATEMENT match (:person)-[w:workAt]->(:organisation) return w.year
---- ok
-STATEMENT CREATE NODE TABLE books (ID INT64, rating DOUBLE DEFAULT 0, PRIMARY KEY (ID));
---- ok
-STATEMENT CREATE (b:books {ID: 0});
---- ok
-STATEMENT MATCH (b:books) RETURN b.*;
---- 1
0|0.000000

-LOG DDLOutputMessages
-STATEMENT CREATE NODE TABLE university(ID INT64, PRIMARY KEY(ID))
---- ok
-STATEMENT CREATE REL TABLE nearTo(FROM university TO university, MANY_TO_MANY)
---- ok
-STATEMENT DROP TABLE nearTo;
---- ok
-STATEMENT DROP TABLE university
---- ok
-STATEMENT ALTER TABLE person DROP fName
---- ok
-STATEMENT ALTER TABLE person DROP if exists fName
---- ok
-STATEMENT ALTER TABLE knows DROP date
---- ok
-STATEMENT ALTER TABLE knows DROP if exists date
---- ok

-LOG CreateRelGroup
-SKIP: batch CREATE REL is not supported. (TODO: zhanglei)
-STATEMENT CREATE REL TABLE likes (FROM person TO person, FROM person TO organisation, since INT64);
---- ok
-STATEMENT Call table_info('likes_person_person') RETURN *;
---- 1
1|since|INT64|NULL|both
-STATEMENT Call table_info('likes_person_organisation') RETURN *;
---- 1
1|since|INT64|NULL|both
-STATEMENT CREATE REL TABLE likes (FROM person TO person, FROM person TO organisation);
---- error
Binder exception: likes already exists in catalog.
-STATEMENT CREATE REL TABLE knows (FROM person TO person, FROM person TO organisation);
---- error
Binder exception: knows already exists in catalog.
-STATEMENT CREATE REL TABLE test_person_person (FROM person TO person);
---- ok
-STATEMENT CREATE REL TABLE test (FROM person TO person, FROM person TO organisation);
---- error
Catalog exception: test_person_person already exists in catalog.
-STATEMENT CREATE REL TABLE test2 (FROM person TO person, FROM person TO person);
---- error
Binder exception: Found duplicate FROM-TO person-person pairs.

-LOG CreateNodeTableCommitNormalExecution
-STATEMENT CREATE NODE TABLE EXAM_PAPER(STUDENT_ID INT64, MARK DOUBLE, PRIMARY KEY(STUDENT_ID))
---- ok
-STATEMENT MATCH (e:EXAM_PAPER) RETURN *
---- 0

-LOG CreateRelTableCommitNormalExecution
-STATEMENT CREATE REL TABLE likes(FROM person TO organisation, RATING INT64, MANY_TO_ONE)
---- ok
-STATEMENT MATCH (:person)-[e:likes]->(:organisation) RETURN count(*)
---- 1
0

-LOG DropNodeTableCommitNormalExecution
-SKIP: Drop is not supported yet.
-STATEMENT DROP TABLE movies
---- ok
-STATEMENT MATCH (m:movies) RETURN count(*)
---- error
Binder exception: Table movies does not exist.

-LOG DropRelTableCommitNormalExecutiona
-SKIP: Drop is not supported yet.
-STATEMENT DROP TABLE knows
---- ok
-STATEMENT MATCH ()-[k:knows]->() RETURN count(*)
---- error
Binder exception: Table knows does not exist.

-LOG AddVertexProperty
-STATEMENT ALTER TABLE person add prox int32;
---- ok
-LOG CheckAddedProperty
-STATEMENT Match (p:person) return SUM(p.prox);
---- 1
0

-LOG AddNodePropertyIfNotExists
-SKIP
-STATEMENT alter table Comment add IF NOT EXISTS id int64 default 1;
---- ok

-STATEMENT CALL TABLE_INFO('Comment') RETURN *;
---- 5
0|id|INT64|NULL|True
1|propx|INT64|NULL|False
2|propi|FLOAT|5.4|False
3|propj|INT32|5 + 5|False
4|propy|INT64|1|False

-LOG AddRelPropertyIfNotExists
-SKIP
-STATEMENT alter table replyOf add if not exists propy int64 default 1;
---- ok

-STATEMENT CALL TABLE_INFO('replyOf') RETURN *;
---- 2
1|propx|INT64|NULL|both
2|propy|INT64|1|both

-LOG DropNodeTablePropertyNormalExecution
-SKIP: Drop is not supported yet.
-STATEMENT ALTER TABLE person DROP gender
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-LOG DropRelTablePropertyNormalExecution
-SKIP: Drop is not supported yet.
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-LOG AddInt64PropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random INT64 DEFAULT 8
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
8
8
8
8
8
8
8
8

-LOG AddStringPropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: do not support adding existing properties (TODO: zhanglei)
-STATEMENT ALTER TABLE person ADD random STRING DEFAULT 'long long string'
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
long long string
long long string
long long string
long long string
long long string
long long string
long long string
long long string

-LOG AddListOfInt64PropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: List of INT64 with default value is not supported yet
-STATEMENT ALTER TABLE person ADD random INT64[] DEFAULT [142,123,789]
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]

-LOG AddListOfStringPropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: do not support string[]
-STATEMENT ALTER TABLE person ADD random STRING[] DEFAULT ['142','short','long long long string']
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]

-LOG AddListOfListOfStringPropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: STRING[][] with default value is not supported yet
-STATEMENT ALTER TABLE person ADD random STRING[][]
            DEFAULT [['142','51'],['short','long','123'],
            ['long long long string','short short short short short']]
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]

-LOG AddListOfStructPropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: STRUCT is not supported yet.
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
            DEFAULT [{revenue: 23, ages: [1.300000,2.500000]},
            {revenue: 33, ages: [2.700000]},
            {revenue: -4, ages: [22.500000,11.300000,33.200000]}]
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]

-LOG AddMapPropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: map is not supported
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64) DEFAULT map(['key1','key2'],[400,250])
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}

-LOG AddStructPropertyToPersonTableWithDefaultValueNormalExecution
-SKIP: STRUCT is not supported yet.
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])
            DEFAULT {revenue: 123, ages: [1.200000,3.400000,5.600000]}
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}

-DEFINE_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK [
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3



]

-LOG AddInt64PropertyToStudyAtTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random INT64
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-LOG AddStringPropertyToStudyAtTableWithoutDefaultValueNormalExecution
-SKIP: repeated insertion is not supported (TODO: zhanglei)
-STATEMENT ALTER TABLE studyAt ADD random STRING
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-LOG AddListOfInt64PropertyToStudyAtTableWithoutDefaultValueNormalExecution
-SKIP: List of INT64 without default value is not supported yet
-STATEMENT ALTER TABLE studyAt ADD random INT64[]
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-LOG AddListOfStringPropertyToStudyAtTableWithoutDefaultValueNormalExecution
-SKIP: STRING[] is not supported yet
-STATEMENT ALTER TABLE studyAt ADD random STRING[]
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-LOG AddInt64PropertyToStudyAtTableWithDefaultValueNormalExecution
-SKIP: repeated insertion is not supported
-STATEMENT ALTER TABLE studyAt ADD random INT64 DEFAULT 42
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
42
42
42

-LOG AddStringPropertyToStudyAtTableWithDefaultValueNormalExecution
-SKIP: repeated insertion is not supported
-STATEMENT ALTER TABLE studyAt ADD random STRING DEFAULT 'VERY LONG STRING!!'
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
VERY LONG STRING!!
VERY LONG STRING!!
VERY LONG STRING!!

-LOG AddListOfINT64PropertyToStudyAtTableWithDefaultValueNormalExecution
-SKIP: List of INT64 with default value is not supported yet
-STATEMENT ALTER TABLE studyAt ADD random INT64[] DEFAULT [11,15,20]
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
[11,15,20]
[11,15,20]
[11,15,20]

-LOG AddListOfStringPropertyToStudyAtTableWithDefaultValueNormalExecution
-SKIP: STRING[] is not supported yet
-STATEMENT ALTER TABLE studyAt ADD random STRING[] DEFAULT ['13','15','long string!!']
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
[13,15,long string!!]
[13,15,long string!!]
[13,15,long string!!]

-LOG AddListOfListOfStringPropertyToStudyAtTableWithDefaultValueNormalExecution
-SKIP: STRING[][] with default value is not supported yet
-STATEMENT ALTER TABLE studyAt ADD random STRING[][]
            DEFAULT [['hello','good','long long string test'],
            ['6'],['very very long string']]
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
[[hello,good,long long string test],[6],[very very long string]]
[[hello,good,long long string test],[6],[very very long string]]
[[hello,good,long long string test],[6],[very very long string]]

-LOG AddPropertyWithComplexExpression
-SKIP: repeated insertion is not supported
-STATEMENT ALTER TABLE person ADD random INT64 DEFAULT  2 * abs(-2)
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
4
4
4
4
4
4
4
4

-LOG RenameTableNormalExecution
-SKIP: rename label is not supported (TODO: zhanglei)
-STATEMENT ALTER TABLE person RENAME TO student
---- ok
-STATEMENT MATCH (s:student) return s.age order by s.age
---- 8
20
20
25
30
35
40
45
83

-LOG RenamePropertyNormalExecution
-STATEMENT ALTER TABLE person RENAME age TO Age
---- ok
-STATEMENT MATCH (p:person) return p.Age order by p.Age
---- 8
20
20
25
30
35
40
45
83

-LOG CreateTableIfNotExists
-SKIP:  IF NOT EXISTS is not supported (TODO: zhanglei)
-STATEMENT CREATE NODE TABLE IF NOT EXISTS UW(ID INT64, PRIMARY KEY(ID))
---- 1
Table UW has been created.
-STATEMENT CREATE NODE TABLE IF NOT EXISTS UW (ID INT64, PRIMARY KEY(ID))
---- 1
Table UW already exists.
-STATEMENT CREATE REL TABLE finds (FROM UW TO UW);
---- 1
Table finds has been created.
-STATEMENT CREATE REL TABLE IF NOT EXISTS finds (FROM UW TO UW);
---- 1
Table finds already exists.
-STATEMENT CREATE NODE TABLE student (ID INT64, PRIMARY KEY(ID));
---- 1
Table student has been created.
-STATEMENT CREATE REL TABLE interests(FROM UW to student, From student to student);
---- 1
Table interests has been created.
-STATEMENT CREATE REL TABLE IF NOT EXISTS interests(FROM UW to student, From student to student);
---- 1
Table interests already exists.
-STATEMENT CREATE NODE TABLE IF NOT EXISTS UW1 (ID INT64, PRIMARY KEY(ID))
---- 1
Table UW1 has been created.
-STATEMENT DROP TABLE IF EXISTS UW5
---- 1
Table UW5 does not exist.

-LOG CaseSensitiveProperty
-STATEMENT CREATE NODE TABLE Wrong(id INT64, NAME STRING, name INT64, PRIMARY KEY(id));
---- error
Binder exception: Duplicated column name: name, column name must be unique.
-STATEMENT CREATE NODE TABLE A(id INT64, NAME STRING, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (:A {id:0, NAME:'a'});
---- ok
-STATEMENT MATCH (a:A) RETURN a.ID, a.NAME;
---- 1
0|a
-STATEMENT ALTER TABLE A ADD name STRING;
---- ok
-STATEMENT ALTER TABLE A Drop NAME;
---- ok
-STATEMENT ALTER TABLE A ADD NAME STRING;
---- ok
-STATEMENT MATCH (a:A) RETURN a.ID, a.NAME;
---- 1
0|

-STATEMENT CREATE NODE TABLE TEST_KEYWORD(YIELD STRING, PRIMARY KEY(YIELD))
-UNSUPPORTED: This query was never executed before Issue#1458 was resolved and needs to be re-investigated.
---- ok

-STATEMENT CREATE NODE TABLE default_val_type(val INT64 default 'wrong type', PRIMARY KEY(val))
-UNSUPPORTED: This query was never executed before Issue#1458 was resolved and needs to be re-investigated.
---- error
Binder exception: Expression wrong type has data type STRING but expected INT64. Implicit cast is not supported.
-STATEMENT CREATE NODE TABLE default_val_type(val INT64 default upper('abc'), PRIMARY KEY(val))
-UNSUPPORTED: This query was never executed before Issue#1458 was resolved and needs to be re-investigated.
---- error
Binder exception: Expression UPPER(abc) has data type STRING but expected INT64. Implicit cast is not supported.
-STATEMENT CREATE NODE TABLE default_val_type(val INT64, val1 INT64[3] default 'ABC', PRIMARY KEY(val))
-UNSUPPORTED: This query was never executed before Issue#1458 was resolved and needs to be re-investigated.
---- error
Binder exception: Expression ABC has data type STRING but expected INT64[3]. Implicit cast is not supported.
